eips/eip-esb/transacao.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ans="http://www.ans.gov.br/padroes/tiss/schemas" xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
   <soapenv:Header/>
   <soapenv:Body>
      <ans:solicitacaoProcedimentoWS>
         <ans:cabecalho>
            <ans:identificacaoTransacao>
               <ans:tipoTransacao>SOLICITACAO_PROCEDIMENTOS</ans:tipoTransacao>
               <ans:sequencialTransacao>19004</ans:sequencialTransacao>
               <ans:dataRegistroTransacao>2016-05-24</ans:dataRegistroTransacao>
               <ans:horaRegistroTransacao>11:09:15</ans:horaRegistroTransacao>
            </ans:identificacaoTransacao>
            <ans:origem>
               <ans:identificacaoPrestador>
                  <ans:codigoPrestadorNaOperadora>577502</ans:codigoPrestadorNaOperadora>
               </ans:identificacaoPrestador>
            </ans:origem>
            <ans:destino>
               <ans:registroANS>346659</ans:registroANS>
            </ans:destino>
            <ans:versaoPadrao>3.02.00</ans:versaoPadrao>
         </ans:cabecalho>
         <ans:solicitacaoProcedimento>
            <ans:solicitacaoInternacao>
               <ans:registroANS>346659</ans:registroANS>
               <ans:numeroGuiaPrestador>19004</ans:numeroGuiaPrestador>
               <ans:dadosBeneficiario>
                  <ans:numeroCarteira>0300012580590022</ans:numeroCarteira>
                  <ans:atendimentoRN>N</ans:atendimentoRN>
                  <ans:nomeBeneficiario>ARMANDO BENIGNO JUNIOR</ans:nomeBeneficiario>
               </ans:dadosBeneficiario>
               <ans:identificacaoSolicitante>
                  <ans:dadosDoContratado>
                     <ans:codigoPrestadorNaOperadora>577502</ans:codigoPrestadorNaOperadora>
                     <ans:nomeContratado>HOSPITAL SAO CAMILO</ans:nomeContratado>
                  </ans:dadosDoContratado>
                  <ans:dadosProfissionalContratado>
                     <ans:nomeProfissional>-</ans:nomeProfissional>
                     <ans:conselhoProfissional>6</ans:conselhoProfissional>
                     <ans:numeroConselhoProfissional>3652</ans:numeroConselhoProfissional>
                     <ans:UF>35</ans:UF>
                     <ans:CBOS>225203</ans:CBOS>
                  </ans:dadosProfissionalContratado>
               </ans:identificacaoSolicitante>
               <ans:dadosHospitalSolicitado>
                  <ans:codigoIndicadonaOperadora>577502</ans:codigoIndicadonaOperadora>
                  <ans:nomeContratadoIndicado>HOSPITAL SAO CAMILO</ans:nomeContratadoIndicado>
                  <ans:dataSugeridaInternacao>2016-05-23</ans:dataSugeridaInternacao>
               </ans:dadosHospitalSolicitado>
               <ans:dadosInternacao>
                  <ans:caraterAtendimento>1</ans:caraterAtendimento>
                  <ans:tipoInternacao>2</ans:tipoInternacao>
                  <ans:regimeInternacao>1</ans:regimeInternacao>
                  <ans:qtDiariasSolicitadas>1</ans:qtDiariasSolicitadas>
                  <ans:indicadorOPME>S</ans:indicadorOPME>
                  <ans:indicadorQuimio>N</ans:indicadorQuimio>
                  <ans:indicacaoClinica>teste</ans:indicacaoClinica>
               </ans:dadosInternacao>
               <ans:hipotesesDiagnosticas>
                  <ans:diagnosticoCID>z00</ans:diagnosticoCID>
                  <ans:indicadorAcidente>9</ans:indicadorAcidente>
               </ans:hipotesesDiagnosticas>
               <ans:procedimentosSolicitados>
                  <ans:procedimento>
                     <ans:codigoTabela>00</ans:codigoTabela>
                     <ans:codigoProcedimento>30912032</ans:codigoProcedimento>
                     <ans:descricaoProcedimento>ANGIOPLASTIA TRANSLUMINAL PERCUTANEA DE MULTIPLOS VASOS, COM IMPLANTE DE STENT</ans:descricaoProcedimento>
                  </ans:procedimento>
                  <ans:quantidadeSolicitada>1</ans:quantidadeSolicitada>
               </ans:procedimentosSolicitados>
               <ans:procedimentosSolicitados>
                  <ans:procedimento>
                     <ans:codigoTabela>00</ans:codigoTabela>
                     <ans:codigoProcedimento>31009140</ans:codigoProcedimento>
                     <ans:descricaoProcedimento>HERNIORRAFIA RECIDIVANTE</ans:descricaoProcedimento>
                  </ans:procedimento>
                  <ans:quantidadeSolicitada>1</ans:quantidadeSolicitada>
               </ans:procedimentosSolicitados>
               <ans:dataSolicitacao>2016-05-24</ans:dataSolicitacao>
               <ans:anexoClinico>
                  <ans:solicitacaoOPME>
                     <ans:cabecalhoAnexo>
                        <ans:registroANS>346659</ans:registroANS>
                        <ans:numeroGuiaAnexo>53877</ans:numeroGuiaAnexo>
                        <ans:numeroGuiaReferenciada>17962</ans:numeroGuiaReferenciada>
                        <ans:dataSolicitacao>2016-05-24</ans:dataSolicitacao>
                     </ans:cabecalhoAnexo>
                     <ans:dadosBeneficiario>
                        <ans:numeroCarteira>0300012580590022</ans:numeroCarteira>
                        <ans:atendimentoRN>N</ans:atendimentoRN>
                        <ans:nomeBeneficiario>ARMANDO BENIGNO JUNIOR</ans:nomeBeneficiario>
                     </ans:dadosBeneficiario>
                     <ans:profissionalSolicitante>
                        <ans:nomeProfissional>Juliana</ans:nomeProfissional>
                        <ans:telefoneProfissional>21212121</ans:telefoneProfissional>
                        <ans:emailProfissional>juliana.laureano@cassi.com.br</ans:emailProfissional>
                     </ans:profissionalSolicitante>
                     <ans:justificativaTecnica>teste</ans:justificativaTecnica>
                     <ans:opmeSolicitadas>
                        <ans:opmeSolicitada>
                           <ans:identificacaoOPME>
                              <ans:codigoTabela>19</ans:codigoTabela>
                              <ans:codigoProcedimento>70000034</ans:codigoProcedimento>
                              <ans:descricaoProcedimento>(CROSS LINK) PARAFUSO PARA FIXACAO CENTRAL TRANSVERSAL</ans:descricaoProcedimento>
                           </ans:identificacaoOPME>
                           <ans:opcaoFabricante>1</ans:opcaoFabricante>
                           <ans:quantidadeSolicitada>2</ans:quantidadeSolicitada>
                           <ans:valorSolicitado>3000.00</ans:valorSolicitado>
                           <ans:registroANVISA>333</ans:registroANVISA>
                           <ans:codigoRefFabricante>2222</ans:codigoRefFabricante>
                           <ans:autorizacaoFuncionamento>?</ans:autorizacaoFuncionamento>
                        </ans:opmeSolicitada>
                     </ans:opmeSolicitadas>
                  </ans:solicitacaoOPME>
               </ans:anexoClinico>
            </ans:solicitacaoInternacao>
         </ans:solicitacaoProcedimento>
         <ans:hash>09BE569ADB66211988820EFFFC6188C4</ans:hash>
      </ans:solicitacaoProcedimentoWS>
   </soapenv:Body>
</soapenv:Envelope> 
